app/controllers/products_controller.rb

    def search
        if params.has_key?(:search) and params.has_key?(:field)
	    @products = Product.search(params[:search]).sort_by(params[:field])
---
SELECT "products".* FROM "products" WHERE ( lower(name) LIKE lower('%cola%') OR lower(description) LIKE lower('%cola%') )  ORDER BY created_at DESC

    def create
	values = create_update_params
	values[:start] = DateTime.now.to_formatted_s(:db)
        values[:end] = fix_date(values.delete("end(1i)"), values.delete("end(2i)"), values.delete("end(3i)"), values.delete("end(4i)"), values.delete("end(5i)"))
		values[:pledges] = 0
		values[:user_id] = User.pluck(:id).sample
        p = Product.new(values)
        if p.save
---
SELECT "users"."id" FROM "users"
INSERT INTO "products" ("name", "description", "price", "target", "start", "end", "pledges", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)